# -*- coding: utf-8 -*-
"""laba1.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1flQOsGU63t63haMSMy6h4CEMkBDk85kc

Лабораторная работа №1 Введение в специальность
"""

print("Hello world")

a = 5
b = 2
c = a + b
print(c)

"""Вычисление площади равнобедренного треугольника.
Дано: стороны равны 7.5 см.
Предположим, что это катеты равнобедренного треугольника: a = 7.5 равнобедренного треугольника b = 7.5
Вычисляем площадь.
"""

#Самостоятельно напишите программу которая будет вычислять площадь равнобедренного треугольника, со-сторонами равными 7.5 см

a = 7.5
b = 7.5
c = (a * b) / 2

"""1. Ввод данных от пользователя
2. Вычисление x
3. Вывод результата
"""

print("Введите значения")
a = float(input("a = "))
b = float(input("b = "))
c = float(input("c = "))
x = (a**2 + b**2 - c**3) / 2
print(f"({a}² + {b}² - {c}³) / 2 = {x}")
print(f"x = {x}")

#Задание 1: Произведение чисел

a = 5
b = int(input())
print(a * b)

#Задание 2: Квадрат суммы чисел

a = int(input())
b = int(input())
print((a + b) ** 2)

#Задание 3: Сумма чисел, деленная на C

a = 15
b = 10
c = int(input())
print((a + b) / c)

#Задание 4: Формула квадрата суммы

a = int(input())
b = int(input())
print((a + b) ** 2)

#Задание 5: Площадь и периметр неравнобедренного треугольника

a = int(input())
b = int(input())
c = int(input())
p = (a + b + c) / 2
print(a + b + c) #периметр
print((p * (p - a) * (p - b) * (p - c)) ** 0.5) #площадь

#Задание 6: Решение неравенства

a = int(input())
b = int(input())
print(((a ** 3 + 14) / 5) * b)

#Задание 7: Квадрат числа, деленный на n

num = int(input())
n = int(input())
print((num ** 2) // n)

#Задание 8: Различные операции с числами

#Деление дробных без остатка
n1 = int(input())
n2 = int(input())
print(n1 // n2)

#Умножение натуральных
m1 = int(input())
m2 = int(input())
print(m1 * m2)

#Остаток от деления
print(m1 % m2)

#Пользователь вводит число секунд равное n. Рассчитайте сколько дней/часов/минут в введённом количестве секунд.

n = int(input())
days = n // 86400
hours = (n % 86400) // 3600
minutes = (n % 3600) // 60
print(days, hours, minutes, seconds)

#При заданном целом числе n посчитайте n + nn + nnn.

n = int(input())
print(int(n) + int(n*2) + int(n*3))